<?php

/***********************************
 *Note:		:框架核心文件
 *Author	:Kermit
 *QQ		:956952515
 *note		:中国.山东.青岛
 *date		:2014-12

  keframe:可以做语言上的矮子，但要争做行动上的巨人。
 ***********************************/
 
interface KeKe
{


	/***********************************
			实例化类
	 ***********************************/

	function __construct(&$KE=NULL);
	
	
	
	/***********************************
			全局设置方法
	 ***********************************/
     
	function __set($key,$value);
	
	
	
	/***********************************
			全局获取方法
	 ***********************************/
	
	function __get($key);

	
}