<?php

/***********************************
 *Note:		:标准对象文件
 *Author	:Kermit
 *QQ		:956952515
 *note		:中国.山东.青岛
 *date		:2014-12

  keframe:可以做语言上的矮子，但要争做行动上的巨人。
 ***********************************/
 
class KeStdclass extends stdClass
{

	/***********************************
			全局设置方法
	 ***********************************/
	 
	public function __set($key, $value)
	{
		
		$this->$key = $value;

	}
	
	
	/***********************************
			全局调用方法
	 ***********************************/
	 
	public function __get($key)
	{

		return NULL;

	}


		
}