<?php

/***********************************
 *Note:		:数据源配置文件
 *Author	:Kermit
 *QQ		:956952515
 *note		:中国.山东.青岛
 *date		:2014-12

  keframe:可以做语言上的矮子，但要争做行动上的巨人。
 ***********************************/

return array(
	
	/*************************
			mysql配置
	 ************************/
	
	'mysql'=>array(

		'db_04007'=>array(
			'note'=>'04007数据库',
			'host'=>'127.0.0.1',
			'port'=>'3306',
			'username'=>'kermit',
			'password'=>'123456',
			'database'=>'04007CN',
			'charset'=>'utf8',
		),

	),


	/*************************
			redis配置
	 ************************/

	'redis'=>array(
		
		'local_redis'=>array(
			'note'=>'本地Redis',
			'host'=>'127.0.0.1',
			'port'=>'6379',
			'auth'=>'',
		),

	),

	
	/*************************
			接口调用地址
	 ************************/
	'interface'=>array(
	)
	


);